Wing/Base/0/p
/*----------------------------------------------------------------------------------*\
|                                                                                    | 
|    ANSA_VERSION: 22.1.0                                                            | 
|                                                                                    | 
|    file created by  A N S A  Mon Feb 28 15:04:06 2022                              | 
|                                                                                    | 
|    Output from: /home/dvlastos/TzimiNiki/Untitled.ansa                             | 
|                                                                                    | 
\*----------------------------------------------------------------------------------*/



FoamFile
{
	version 2.0;
	format binary;
	class volScalarField;
	location "";
	object p;
}
/*---------------------------------------------------------------------------*/
/*---------------------------------------------------------------------------*/


dimensions [0 2 -2 0 0 0 0];

internalField uniform 0.;


boundaryField
{
	Farfield
	{
		type freestream;
		freestreamValue	$internalField;
	}

	Airfoil
	{
		type zeroGradient;
	}

	SideHigh
	{
		type empty;
	}
	SideLow
	{
		type empty;
	}


}
